; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph3 - mode
	spectrograph5 - mode
	image2 - mode
	image4 - mode
	thermograph0 - mode
	spectrograph1 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation0 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 spectrograph5)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(supports instrument0 image4)
	(supports instrument0 image2)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
)
(:goal (and
	(pointing satellite0 Star11)
	(have_image Phenomenon7 thermograph0)
	(have_image Phenomenon7 image4)
	(have_image Phenomenon8 spectrograph1)
	(have_image Phenomenon8 spectrograph5)
	(have_image Phenomenon9 thermograph0)
	(have_image Phenomenon10 thermograph3)
	(have_image Phenomenon10 spectrograph5)
	(have_image Star11 thermograph3)
	(have_image Star11 image4)
	(have_image Phenomenon12 thermograph3)
	(have_image Phenomenon13 image2)
	(have_image Phenomenon14 image4)
	(have_image Star15 image4)
	(have_image Planet16 spectrograph5)
))

)

; plan
1. (turn_to satellite0 groundstation0 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 15
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 15
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 15
4. (turn_to satellite0 planet16 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet16)
   goals met: 0 of 15
5. (take_image satellite0 planet16 instrument0 spectrograph5)
   added: (have_image planet16 spectrograph5)
   goals met: 1 of 15
6. (turn_to satellite0 phenomenon9 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 15
7. (take_image satellite0 phenomenon9 instrument0 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 2 of 15
8. (turn_to satellite0 phenomenon14 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 15
9. (take_image satellite0 phenomenon14 instrument0 image4)
   added: (have_image phenomenon14 image4)
   goals met: 3 of 15
10. (turn_to satellite0 phenomenon13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 15
11. (take_image satellite0 phenomenon13 instrument0 image2)
   added: (have_image phenomenon13 image2)
   goals met: 4 of 15
12. (turn_to satellite0 phenomenon12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 15
13. (take_image satellite0 phenomenon12 instrument0 thermograph3)
   added: (have_image phenomenon12 thermograph3)
   goals met: 5 of 15
14. (turn_to satellite0 phenomenon10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 15
15. (take_image satellite0 phenomenon10 instrument0 thermograph3)
   added: (have_image phenomenon10 thermograph3)
   goals met: 6 of 15
16. (take_image satellite0 phenomenon10 instrument0 spectrograph5)
   added: (have_image phenomenon10 spectrograph5)
   goals met: 7 of 15
17. (turn_to satellite0 phenomenon7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon7)
   goals met: 7 of 15
18. (take_image satellite0 phenomenon7 instrument0 image4)
   added: (have_image phenomenon7 image4)
   goals met: 8 of 15
19. (take_image satellite0 phenomenon7 instrument0 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 9 of 15
20. (turn_to satellite0 phenomenon8 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon8)
   goals met: 9 of 15
21. (take_image satellite0 phenomenon8 instrument0 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 10 of 15
22. (take_image satellite0 phenomenon8 instrument0 spectrograph5)
   added: (have_image phenomenon8 spectrograph5)
   goals met: 11 of 15
23. (turn_to satellite0 star15 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star15)
   goals met: 11 of 15
24. (take_image satellite0 star15 instrument0 image4)
   added: (have_image star15 image4)
   goals met: 12 of 15
25. (turn_to satellite0 star11 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star11)
   goals met: 13 of 15
26. (take_image satellite0 star11 instrument0 image4)
   added: (have_image star11 image4)
   goals met: 14 of 15
27. (take_image satellite0 star11 instrument0 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 15 of 15
